{
    "@class": "com.kony.gen.viz.model.container.KVizSegment2",
    "DNDConfig": null,
    "__parentReadjusting__": false,
    "_data_": [
        {
            "lblSeperator": {
                "@class": "com.viz.ide.model.segment.SimpleTextSegmentData",
                "text": "."
            },
            "lblSubHeading": {
                "@class": "com.viz.ide.model.segment.SimpleTextSegmentData",
                "text": "SUB - HEADING 1"
            },
            "rtxTermsAndCond": {
                "@class": "com.viz.ide.model.segment.SimpleTextSegmentData",
                "text": "You authorize, XYZ Bank, to:\n\n\n1. Pull a credit report on you and co-applicant (if any) in order to make a credit decision.\n\n\n2. Use the information on this application and any other information we or our affiliates have about you to determine your ability to pay, as required by federal law.\n\n\n3. Verify, at our option and for your benefit, your application information.\n\n\n4. Contact you or receive a detailed message or messages at the telephone, email or direct mail contact data you provided above for purposes of fulfilling this inquiry about automobile loan financing even if you have previously registered on a Do No Call registry or requested XYZ Bank not to send marketing information to you by email and/or direct mail.\n"
            }
        },
        {
            "lblSeperator": {
                "@class": "com.viz.ide.model.segment.SimpleTextSegmentData",
                "text": "."
            },
            "lblSubHeading": {
                "@class": "com.viz.ide.model.segment.SimpleTextSegmentData",
                "text": "SUB - HEADING 2"
            },
            "rtxTermsAndCond": {
                "@class": "com.viz.ide.model.segment.SimpleTextSegmentData",
                "text": "By giving us your phone number and submitting this application, you acknowledge that,  1. You've reviewed any special disclosure that applies in your state: ME, CA, NY, RI, OH, VT and WI residents  2. All information you've submitted is true and correct and is given to obtain credit from us  3. Co-applicant (if any) has authorized you to submit this application on his or her behalf.  4. You and co-applicant (if any) are of legal contracting age.  5. Credit approval, Annual Percentage Rate (APR), and credit terms are based on our review of each applicant’s application information and credit report.  6. You understand we collect your individual income information to determine your individual ability to pay. Examples may include income earned from your employment (salary, overtime, bonus), retirement/pension benefits, and rental properties. Student loans are not acceptable sources of income. Alimony, child support, or separate maintenance income need not be revealed if you don't wish it to be considered as a basis for repayment.And you agree that XYZ Bank, N.A. may,  Use automatic telephone dialling systems and prerecorded voice messages in connection with calls or texts made to any telephone number you provide even if the telephone number is assigned to a cellular/mobile telephone service or other service for which the called party is charged according to their normal text messaging rates.    Privacy  All financial institutions are required by federal law to obtain, verify and record information that identifies each customer before opening an account with us. When you open an account with us, we will ask you for your name, address and other information that will allow us to identify you, such as Social Security number and date of birth. In addition, if the account application is approved, do we have your permission to open your account prior to sending you a copy of our XYZ Bank US Consumer Privacy Notice, which will be sent with your customary account disclosures?    Electronic Consumer Information consent  To receive the Consumer Information electronically, scroll to read the complete disclosure and then select I consent on this page.    As part of your online loan application, XYZ bank., is required by law to provide you with certain Consumer Information. You have the right to receive the Consumer Information on paper. With your consent, we may provide the Consumer Information to you electronically instead. If you prefer to receive the Consumer Information on paper, you’ll need to visit any XYZ banking center to apply in person.    Your consent only applies to this loan application and the documents listed here. You aren't required to consent to receive information electronically to complete this application. If you’d like to withdraw your consent after consenting to receive information electronically, or if after receiving electronic documents you would like paper copies, you may do so in the Application Status Center or contact us at 1.888.266.1034 and we will provide you with paper copies at no charge. You can also update your contact information with us by calling that same telephone number. Consent withdrawal won’t apply to any actions already taken or initiated in reliance on your consent.    Type of electronic Consumer Information you may receive:  ●     Credit Score Notice, if your application is approved  ●     Adverse Action Letter, if your application is declined  ●     Any other information related to your application"
            }
        }
    ],
    "_height_": {
        "type": "ref",
        "value": "preferred"
    },
    "_indicator_": "none",
    "_left_": {
        "type": "string",
        "value": "0dp"
    },
    "_margin_": [
        0,
        0,
        0,
        0
    ],
    "_orientation_": 2,
    "_padding_": [
        0,
        0,
        0,
        0
    ],
    "_top_": {
        "type": "string",
        "value": "0dp"
    },
    "_width_": {
        "type": "string",
        "value": "99%"
    },
    "autogrowmode": 1,
    "canUpdateUI": true,
    "containerweight": 100,
    "counter": "01",
    "focusedindex": null,
    "focuseditem": null,
    "groupcells": false,
    "hasSections": false,
    "id": "segTermsAndCond",
    "info": null,
    "ipad": {
        "psp": {
            "indicator": "rowselect"
        }
    },
    "iphone": {
        "psp": {
            "indicator": "rowselect"
        }
    },
    "iscustomlayout": false,
    "isvisible": false,
    "kuid": "c727596a4727487e8438444d9416b643",
    "masterdata": {},
    "name": "kony.ui.SegmentedUI2",
    "needpageindicator": true,
    "pageoffdotimage": "pageoffdot.png",
    "pageondotimage": "pageondot.png",
    "paginationconfig": {
        "position": "bottom"
    },
    "parent": "flxTermsAndCoditions",
    "pf": "frmAssistedOnboarding",
    "retaincontentalignment": false,
    "retainflexpositionproperties": false,
    "retainselection": false,
    "rowTemplateId": "f8c65590a35546efbfebdee8255b86fc",
    "rowcounter": 1,
    "rowfocusskin": "se901dcdd2ae4a58a81f21c009edf99e",
    "rowskin": "s54014e0d4204ce9acd27107655ded87",
    "rowtemplate": "flxTAndC",
    "screenlevelwidget": false,
    "seccounter": 0,
    "sectionHeaderTemplateId": null,
    "sectionheaderskin": "sffa0c1a0560403189088e98f7b4f498",
    "selectedRows": null,
    "selectedState": false,
    "selectedindex": null,
    "selectedindices": null,
    "selecteditems": null,
    "selectedsectionindex": 0,
    "selectionbehavior": "default",
    "separatorrequired": false,
    "showscrollbars": false,
    "viewtype": "tableview",
    "vizProps": {},
    "wType": "Segment",
    "widgetalignment": 5,
    "widgetdatamap": {
        "flxTAndC": "flxTAndC",
        "flxTAndCHeader": "flxTAndCHeader",
        "lblSeperator": "lblSeperator",
        "lblSubHeading": "lblSubHeading",
        "rtxTermsAndCond": "rtxTermsAndCond"
    },
    "zindex": 1
}